Documents/КорректировкаГрузовогоМеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>КорректировкаГрузовогоМеста</Name>
			<BasedOn>
				<xr:Item>Document.ГрузовоеМесто</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГрузовоеМесто</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ГрузовоеМесто</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузополучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоВГрузоместе</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтрокиКМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КодыМаркировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодСтрокиКМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМаркировки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СпособДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Самовывоз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НашаДоставка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/КорректировкаГрузовогоМеста/Ext/ManagerModule.bsl
Процедура ПечатьЗаданияНаКорректировку(ПромДок, ИмяМакета, ВернутьТабДок = Неопределено) Экспорт
	
	Макет = ПолучитьМакет("ЗаданиеНаКорректировку");
	ТабДок  = Новый ТабличныйДокумент;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	
	Если ПромДок.ГрузовоеМесто.Сборка.СпособДоставки = Перечисления.СпособДоставки.Самовывоз Тогда
		ПечМаршрутДоставки = ?(ПромДок.ГрузовоеМесто.Сборка.ТаксиДоставка, "ТАКСИ ДОСТАВКА", "Самовывоз");	
	Иначе
		ПечМаршрутДоставки = СокрЛП(ПромДок.ГрузовоеМесто.Сборка.МаршрутДоставки);
	КонецЕсли;
	
	ОбластьМакета.Параметры.МаршрутДоставки = ПечМаршрутДоставки;
	ОбластьМакета.Параметры.Номер = ПромДок.Номер;
	ОбластьМакета.Параметры.Дата = Формат(ПромДок.Дата, "ДЛФ=D");
	ОбластьМакета.Параметры.НомерCборки = ПромДок.ГрузовоеМесто.Сборка.Номер;
	ОбластьМакета.Параметры.ДатаСборки = Формат(ПромДок.ГрузовоеМесто.Сборка.Дата, "ДЛФ=D");
	ОбластьМакета.Параметры.Клиент = ПромДок.Грузополучатель.Наименование; 
	ОбластьМакета.Параметры.СпособДоставки = ПромДок.ГрузовоеМесто.Сборка.СпособДоставки;
		
	Если ЗначениеЗаполнено(ПромДок.ГрузовоеМесто.ШКОбособленного) Тогда
		
		ПромНомерГМ = Прав(ПромДок.ГрузовоеМесто.ШКОбособленного, 9); 
		
		Пока Лев(ПромНомерГМ, 1) = "0" Цикл
			ПромНомерГМ = Сред(ПромНомерГМ, 2);
		КонецЦикла;   
		 
		ОбластьМакета.Параметры.Код = "Транзит" + Символы.ПС + СокрЛП("ГМ" + ПромНомерГМ); 
		
	Иначе
		ОбластьМакета.Параметры.Код = СокрЛП("ГМ" + ОбщегоНазначения.ПолучитьНомерНаПечать(ПромДок.ГрузовоеМесто,,, Истина));
	КонецЕсли; 
	
	ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабДок, Макет, ОбластьМакета, ПромДок.Ссылка); 
	
	ТабДок.Вывести(ОбластьМакета);
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	Для Каждого СтрокаТовары Из ПромДок.Товары Цикл
		
		ОбластьСтрока.Параметры.Сч = СтрокаТовары.НомерСтроки;
		ОбластьСтрока.Параметры.Производитель = СтрокаТовары.Номенклатура.Родитель;
		ОбластьСтрока.Параметры.КодПроизводителя = СтрокаТовары.Номенклатура.КодПроизводителя;
		ОбластьСтрока.Параметры.Номенклатура = СтрокаТовары.Номенклатура.Наименование;
		ОбластьСтрока.Параметры.Кол = СтрокаТовары.КоличествоВГрузоместе;
		ОбластьСтрока.Параметры.КолИзъять = СтрокаТовары.Количество;  
		
		ТабДок.Вывести(ОбластьСтрока);
		
	КонецЦикла;    
	
	ТабДок.АвтоМасштаб = Истина;
	
	МСК.ЗафиксироватьПечатьДокумента(ПромДок.Ссылка, ИмяМакета, "Задание на корректировку ГМ");
	
	Если ВернутьТабДок = Неопределено Тогда			
		ТабДок.Показать();
	Иначе
		ВернутьТабДок = ТабДок;	
	КонецЕсли;	
	
КонецПроцедуры
